{
  "backend/main.mo": "Main Motoko actor defining all backend data types, state maps, and business logic for users, packages, payments, referrals, landing pages, and Stripe integration. Includes access control, blob storage mixins, and admin/user management functions.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated file paths, component dependencies, test IDs, and confidence levels for tracking what was built and where.",
  "frontend-file-summaries.txt": "JSON mapping of frontend source file paths to short human-readable summaries describing each component's purpose and notable recent changes.",
  "frontend/index.css": "Global CSS entry point that sets up Tailwind base/components/utilities layers and defines CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML shell with SEO meta tags, Open Graph, and Twitter card metadata for Evergreen Hub, mounting the React app via a root div and Vite module script.",
  "frontend/src/App.tsx": "Root application file that defines all TanStack Router routes for the landing page, auth pages, user dashboard, and admin dashboard, and composes the LandingPage layout using FounderSection instead of FacebookSection.",
  "frontend/src/components/admin/ImageModal.tsx": "A dialog modal that displays a full-size payment screenshot image passed via props.",
  "frontend/src/components/admin/PackageModal.tsx": "A dialog form for creating or editing a course package (name, price, courses), using React Query mutations to call the backend actor.",
  "frontend/src/components/AppearanceSettingsModal.tsx": "Modal dialog component allowing users to switch between light, dark, and system themes using a radio group, persisting the selection via the ThemeContext.",
  "frontend/src/components/BottomCTASection.tsx": "A bottom call-to-action section with a gradient background that displays a 'Start Learning Today' message and a button that smoothly scrolls to the courses section.",
  "frontend/src/components/CommissionChart.tsx": "Displays a table of commission data for various packages, showing price, active income, and passive income earned through referrals.",
  "frontend/src/components/CongratulationsModal.tsx": "A modal dialog shown after successful payment submission, displaying a congratulatory message with a random motivational quote and a WhatsApp share button.",
  "frontend/src/components/ContactFormSection.tsx": "A section wrapper with scroll animation that renders the ContactInterestForm inside a styled card with a header and icon.",
  "frontend/src/components/ContactInterestForm.tsx": "A contact form that collects name, phone, email, and message, validates inputs, and opens a pre-filled WhatsApp message on submission with an auto-reset success state.",
  "frontend/src/components/CountdownBanner.tsx": "A sticky top banner displaying a live countdown timer (hours, minutes, seconds) that resets to 24 hours, used to create urgency for a limited-time offer.",
  "frontend/src/components/CoursePackagesModal.tsx": "A modal that fetches and displays active course packages in a grid of cards, allowing users to select a package which then opens a PaymentModal.",
  "frontend/src/components/EvergreenAIChatbot.tsx": "Empty file with no content.",
  "frontend/src/components/FacebookSection.tsx": "Empty file with no content.",
  "frontend/src/components/FAQSection.tsx": "Renders a FAQ section with an accordion component containing five common questions about affiliate marketing, with scroll-triggered fade-in animation.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Renders a fixed floating WhatsApp button in the bottom-right corner that links to a pre-filled WhatsApp chat with a masked phone number display.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, social media links (Facebook, Instagram, YouTube), quick navigation links, and legal page links including copyright notice.",
  "frontend/src/components/FounderSection.tsx": "Displays a profile section for the Evergreen Hub founder (Rudra Pratap Singh) with photo, skill badges, bio, and scroll-triggered animations; supports a compact layout prop.",
  "frontend/src/components/GradientBlobs.tsx": "Renders three fixed, full-screen decorative gradient blob elements as a non-interactive background layer.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop navigation links, auth-aware login/register or account dropdown, and a mobile menu toggle that opens a sidebar.",
  "frontend/src/components/HeroSection.tsx": "Full-height hero section with animated headline, subheadline in Hindi/English, and CTA buttons to explore courses (smooth scroll) or open WhatsApp chat.",
  "frontend/src/components/InstagramSection.tsx": "Promotional section with an Instagram gradient card encouraging users to follow the Evergreen Hub Instagram profile, with Follow and View Profile links.",
  "frontend/src/components/MobileSidebar.tsx": "Slide-in mobile navigation sidebar with authenticated user profile display, package accordion links, page navigation, dashboard access, and logout functionality.",
  "frontend/src/components/MyReferralLink.tsx": "Displays the authenticated user's referral link in a card with a copy-to-clipboard button, generating the link from their Internet Identity principal.",
  "frontend/src/components/PaymentGateway.tsx": "Renders a static payment information card showing a PhonePe QR code image and masked India Post Payment Bank details along with step-by-step payment instructions.",
  "frontend/src/components/PaymentModal.tsx": "A dialog modal that combines PaymentGateway and PaymentProofForm to let users submit payment proof for a selected package, showing a CongratulationsModal on success.",
  "frontend/src/components/PaymentProofForm.tsx": "A form component that collects a transaction ID and screenshot file, converts the file to a Uint8Array blob with upload progress tracking, and submits payment proof via a provided callback.",
  "frontend/src/components/PricingSection.tsx": "Displays all six course packages with expandable course lists and inline payment flow (PaymentGateway + PaymentProofForm), submitting payment proofs via a React Query mutation and showing a congratulations modal on success.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to login and non-admin users away from admin routes, showing a loading spinner while auth state initializes.",
  "frontend/src/components/ReferralsSection.tsx": "Displays a user's referral data including commission summary cards (active, passive, pending) and a table of individual referrals with status badges, fetched via custom query hooks.",
  "frontend/src/components/ScrollToTopButton.tsx": "A fixed button that appears after scrolling 300px down and smoothly scrolls the page back to the top when clicked.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a scroll-animated section displaying three hardcoded student testimonials with star ratings, quotes, and avatar initials.",
  "frontend/src/components/ThemeToggleSwitch.tsx": "A ghost icon button that toggles between light and dark themes using the ThemeContext, animating between Sun and Moon icons.",
  "frontend/src/components/TrustBadgesSection.tsx": "Displays a scroll-animated row of trust badge cards highlighting Expert Instructors, 24/7 Support, and Money-Back Guarantee.",
  "frontend/src/components/VideoEditingSection.tsx": "Promotes a professional video editing service priced at ₹1,500, showing feature cards and buttons to open a payment modal or contact via WhatsApp.",
  "frontend/src/components/WebDesignPaymentModal.tsx": "A dialog modal for completing web design package payments, allowing users to enter a transaction ID and screenshot, then send payment proof via WhatsApp.",
  "frontend/src/components/WebDesignServicesPromo.tsx": "A promotional section for web design services showcasing a highlighted Basic Package card, other package tiers, and key highlights, with a payment modal trigger.",
  "frontend/src/components/WelcomeSplashScreen.tsx": "Displays a full-screen animated welcome splash overlay on first visit (per session), featuring floating particles, glowing rings, a logo, and a dismiss button with fade transitions.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Renders a scroll-animated section showcasing four key benefits of Evergreen Hub (expert courses, community, beginner-friendly, lifetime access) in a responsive card grid.",
  "frontend/src/components/YouTubeSection.tsx": "Displays a scroll-animated section embedding an Evergreen Hub YouTube playlist and a subscribe button linking to the channel.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context wrapping Internet Identity login/logout, fetching the user profile and admin status from the backend actor, and exposing them app-wide.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides a theme context supporting light, dark, and system modes, persisting the preference to localStorage and applying the active theme class to the document root.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including packages, payment proofs, user profiles, earnings, withdrawal requests, and landing pages via an actor interface.",
  "frontend/src/hooks/useScrollAnimation.ts": "A custom React hook that uses IntersectionObserver to track when a referenced element enters the viewport, returning a ref and visibility boolean for scroll-triggered animations.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines OKLCH-based CSS custom properties for a light/dark color system, and provides utility classes for theming, shadows, and layout.",
  "frontend/src/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout component with a responsive sidebar navigation (desktop and mobile via Sheet), protected by a ProtectedRoute requiring admin role, and rendering child routes via Outlet.",
  "frontend/src/layouts/UserDashboardLayout.tsx": "User dashboard layout component with a black/green-themed responsive sidebar showing navigation links and user profile info, wrapped in a ProtectedRoute and rendering child routes via Outlet.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page for Evergreen Hub with animated sections covering the company's identity, mission, offerings, values, and team using scroll-triggered animations.",
  "frontend/src/pages/admin/AdminStats.tsx": "Admin dashboard statistics page that fetches and displays total users, sales, revenue, and pending payments from the backend, auto-refreshing every 30 seconds.",
  "frontend/src/pages/admin/PackageManagement.tsx": "Admin page for managing course packages, supporting listing, adding, editing, toggling status, and deleting packages via backend mutations with a modal form and confirmation dialog.",
  "frontend/src/pages/admin/PaymentManagement.tsx": "Admin page for viewing and managing payment proofs, allowing filtering by status and approving or rejecting individual proofs with screenshot preview support.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for listing all registered users with search, block/unblock toggle, and delete functionality using React Query mutations.",
  "frontend/src/pages/admin/WithdrawalManagement.tsx": "Admin page for viewing and managing user withdrawal requests, supporting status filtering and approve/reject actions via actor mutations.",
  "frontend/src/pages/AdminLogin.tsx": "Provides an admin-only login page using Internet Identity authentication, redirecting verified admins to the admin dashboard and denying access to non-admin users.",
  "frontend/src/pages/Contact.tsx": "Renders the Contact page with WhatsApp and phone contact options, a contact interest form, and supporting layout components like Header, Footer, and a floating WhatsApp button.",
  "frontend/src/pages/LandingPagePreview.tsx": "Fetches and displays a landing page by ID from the backend, increments its visit count on load, and renders its HTML content with a 404 fallback if not found.",
  "frontend/src/pages/Login.tsx": "Renders the user login page using Internet Identity authentication, redirecting authenticated users to the dashboard and showing a remember-me checkbox and forgot-password hint.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Displays the Privacy Policy page with scroll-animated sections covering data collection, usage, and user rights, and sets relevant SEO meta tags on mount.",
  "frontend/src/pages/RefundPolicy.tsx": "Displays Evergreen Hub's strict no-refund policy page with scroll animations, SEO meta tags, and sections covering digital product terms and limited exceptions for duplicate payments or technical failures.",
  "frontend/src/pages/Register.tsx": "User registration page that authenticates via Internet Identity, validates form fields (name, email, phone, password), handles referral links via URL params, and registers the user on the ICP backend.",
  "frontend/src/pages/TermsOfService.tsx": "Renders Evergreen Hub's Terms of Service page with animated sections covering acceptance of terms, eligibility, course access, intellectual property, and payment terms, along with SEO meta tag setup.",
  "frontend/src/pages/user/ChangePassword.tsx": "User page with a form to change account password, including validation for length, match, and difference from current password.",
  "frontend/src/pages/user/DashboardOverview.tsx": "User dashboard overview page displaying earnings, approved payment proofs, packages, and referral info alongside an animated rising-bubbles background effect.",
  "frontend/src/pages/user/LandingPageBuilder.tsx": "A page component for creating, editing, and deleting landing pages, with a form supporting title, content, and template fields, and a table listing existing pages.",
  "frontend/src/pages/user/MyLandingPages.tsx": "A page that lists all landing pages created by the authenticated user, with options to preview, edit (navigating to the builder), and delete each page.",
  "frontend/src/pages/user/MyPackages.tsx": "A page that displays the user's purchased packages by fetching their payment proofs and matching them to package details, showing status badges and transaction info.",
  "frontend/src/pages/user/ProfileSettings.tsx": "A settings page allowing users to update their name, phone number, and profile photo, with image preview and upload functionality.",
  "frontend/src/pages/user/WithdrawalRequests.tsx": "A page for submitting withdrawal requests with an amount and message, displaying past requests with status badges, and opening a pre-filled WhatsApp message to notify the admin on submission.",
  "frontend/src/pages/WebDesignServices.tsx": "Web design services landing page showcasing five pricing packages (Basic to Ultra Premium), customer testimonials, FAQs, and a payment modal for initiating purchases.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, extended border radius, box shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata for the Evergreen Hub website, tracking schema version, architectural notes, existing features, known issues, and image requirements for the founder profile section."
}