{
  "backend/main.mo": "Main Motoko actor defining all core data types (UserProfile, Package, Payment, Referral, etc.) and in-memory state maps for an affiliate marketing platform. Includes access control, blob storage, and Stripe/HTTP outcall mixins.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: hiding the WhatsApp phone number from the FloatingWhatsAppButton UI, and embedding the UPI ID internally in payment components without displaying it to users.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose and key changes, serving as a build-planning reference for the React frontend.",
  "frontend/index.css": "Global CSS entry point that sets up Tailwind base/components/utilities and defines CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML shell with SEO meta tags, Open Graph, and Twitter card metadata for the Evergreen Hub affiliate marketing site, mounting the React app at the root div.",
  "frontend/src/App.tsx": "Root application file that configures TanStack Router with all public, user dashboard, and admin routes, inlines the LandingPage component, and wraps the app in Auth, Theme, and Query providers.",
  "frontend/src/components/admin/ImageModal.tsx": "A dialog modal component that displays a full-size payment screenshot image passed via props.",
  "frontend/src/components/admin/PackageModal.tsx": "An admin dialog form for creating or editing course packages, using React Query mutations to call the backend actor's createPackage or updatePackage methods.",
  "frontend/src/components/AppearanceSettingsModal.tsx": "Modal dialog component allowing users to select light, dark, or system theme via a radio group, applying the choice through the ThemeContext on save.",
  "frontend/src/components/BottomCTASection.tsx": "A bottom call-to-action section with a gradient background that displays a 'Start Learning Today' message and a button that smoothly scrolls to the courses section.",
  "frontend/src/components/CommissionChart.tsx": "Displays a table of commission data for six package tiers, showing price, active income, and passive income earned through referrals.",
  "frontend/src/components/CongratulationsModal.tsx": "A modal dialog shown after successful payment submission that displays a congratulatory message with a random motivational quote and a WhatsApp share button.",
  "frontend/src/components/ContactFormSection.tsx": "A section wrapper with scroll animation that renders the ContactInterestForm inside a styled card with a header prompting users to contact via WhatsApp.",
  "frontend/src/components/ContactInterestForm.tsx": "A contact form that collects name, phone, email, and message, saves the submission to the backend, and opens WhatsApp with the pre-filled inquiry message.",
  "frontend/src/components/CountdownBanner.tsx": "A sticky top banner displaying a live countdown timer (hours, minutes, seconds) that resets to 24 hours, used to create urgency for a limited-time offer.",
  "frontend/src/components/CoursePackagesModal.tsx": "A modal that fetches and displays active course packages in a grid of cards, allowing users to select a package which then opens the PaymentModal.",
  "frontend/src/components/EvergreenAIChatbot.tsx": "An empty file with no content or exports.",
  "frontend/src/components/FacebookSection.tsx": "Renders a styled Facebook follow/visit section with scroll animation, linking to the Evergreen Hub Facebook page with 'Like Page' and 'Visit Page' buttons.",
  "frontend/src/components/FAQSection.tsx": "Renders a FAQ section with five accordion items covering common affiliate marketing questions, with scroll-triggered fade-in animation.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Displays a fixed floating WhatsApp chat button that fetches the phone number from persistent site content and links to the WhatsApp chat URL.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, social media links (Facebook, Instagram, YouTube), quick navigation links, and legal/policy links, along with a copyright notice.",
  "frontend/src/components/FounderSection.tsx": "Displays a founder profile section for Rudra Pratap Singh with a photo, skill badges, and bio, featuring scroll animations and a dark gradient background.",
  "frontend/src/components/GradientBlobs.tsx": "Renders three fixed, full-screen decorative gradient blob elements as a non-interactive background layer.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop navigation links, mobile sidebar toggle, and auth-aware controls (login/register or account dropdown with dashboard and logout).",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with animated headline, subheadline in Hindi/English, and CTA buttons to explore courses or open WhatsApp chat.",
  "frontend/src/components/InstagramSection.tsx": "Renders a styled Instagram follow section with scroll animation, linking to the @evergreenhub2026 profile with 'Follow Us' and 'View Profile' buttons.",
  "frontend/src/components/MobileSidebar.tsx": "A mobile navigation sidebar component rendered as a slide-out sheet, providing links to main pages, package listings via accordion, and authenticated user actions like dashboard navigation and logout.",
  "frontend/src/components/MyReferralLink.tsx": "Displays the authenticated user's unique referral link (based on their Internet Identity principal) with a copy-to-clipboard button and sharing tips.",
  "frontend/src/components/PaymentGateway.tsx": "Renders payment options including a UPI/PhonePe QR code and bank transfer details, pulling dynamic content from site settings and falling back to hardcoded defaults.",
  "frontend/src/components/PaymentModal.tsx": "A dialog modal that combines PaymentGateway and PaymentProofForm to guide users through purchasing a package, submitting payment proof via a mutation, and showing a congratulations modal on success.",
  "frontend/src/components/PaymentProofForm.tsx": "A form component that collects a transaction ID and screenshot upload, converts the file to an ExternalBlob with upload progress tracking, and submits the payment proof.",
  "frontend/src/components/PricingSection.tsx": "Displays all available course packages with pricing, course lists, and expandable details, allowing authenticated users to initiate payment inline via PaymentGateway and PaymentProofForm.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to login and non-admin users away from admin routes, showing a loading spinner during auth initialization.",
  "frontend/src/components/ReferralsSection.tsx": "Displays a user's referral list and commission summary (active, passive, pending) fetched via React Query hooks, with status badges and package name mapping.",
  "frontend/src/components/ScrollToTopButton.tsx": "A fixed button that appears after scrolling 300px and smoothly scrolls the page back to the top when clicked.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a scroll-animated section displaying three hardcoded student testimonials with star ratings, names, and locations.",
  "frontend/src/components/ThemeToggleSwitch.tsx": "A button component that toggles between light and dark themes using the ThemeContext, with animated Sun/Moon icon transitions.",
  "frontend/src/components/TrustBadgesSection.tsx": "Displays a scroll-animated row of trust badge cards highlighting Expert Instructors, 24/7 Support, and Money-Back Guarantee.",
  "frontend/src/components/VideoEditingSection.tsx": "A marketing section for a ₹1,500 video editing service featuring feature cards, a payment modal trigger, and a WhatsApp contact button.",
  "frontend/src/components/WebDesignPaymentModal.tsx": "A payment dialog for web design packages that shows UPI payment details, collects a transaction ID and screenshot, and sends proof via WhatsApp.",
  "frontend/src/components/WebDesignServicesPromo.tsx": "Promotional section component for web design services, displaying a Basic Package card with pricing, features, and other package tiers, with a payment modal trigger and scroll animation.",
  "frontend/src/components/WelcomeSplashScreen.tsx": "A one-time-per-session animated splash screen shown on first visit, featuring a logo, floating particles, glowing rings, and a dismiss button that fades out the overlay.",
  "frontend/src/components/WhyChooseUsSection.tsx": "A section component that displays four benefit cards (Expert Courses, Community Support, Beginner Friendly, Lifetime Access) with icons and descriptions, animated on scroll.",
  "frontend/src/components/YouTubeSection.tsx": "A section component that embeds an Evergreen Hub YouTube playlist iframe and provides a subscribe button linking to the channel.",
  "frontend/src/contexts/AuthContext.tsx": "React context providing authentication state (identity, user profile, admin status) and login/logout methods via Internet Identity, with automatic profile refresh on auth changes.",
  "frontend/src/contexts/ThemeContext.tsx": "React context managing light/dark/system theme preference, persisting the selection to localStorage and applying the appropriate CSS class to the document root.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering profile photos, landing pages, packages, payments, users, withdrawals, and more.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to track whether a referenced element is visible in the viewport, supporting configurable threshold, root margin, and single-trigger behavior.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines a comprehensive OKLCH-based CSS custom property color system for both light and dark modes, and adds utility classes for layout and theming.",
  "frontend/src/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout component with a responsive sidebar (desktop and mobile via Sheet) containing navigation links, user info, and logout, wrapping child routes via TanStack Router's Outlet inside a ProtectedRoute.",
  "frontend/src/layouts/UserDashboardLayout.tsx": "User dashboard layout with a responsive sidebar showing navigation links, user profile photo, and logout, wrapping authenticated user routes via TanStack Router's Outlet inside a ProtectedRoute.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page for Evergreen Hub with animated sections covering the company's identity, mission, offerings, values, and team using scroll-triggered animations.",
  "frontend/src/pages/admin/AdminStats.tsx": "Admin dashboard statistics page that fetches and displays platform metrics (total users, sales, revenue, pending payments) as stat cards with loading skeletons and a quick summary section.",
  "frontend/src/pages/admin/ContactInquiries.tsx": "Admin page that displays all contact form submissions in a searchable, filterable table with options to mark inquiries as resolved.",
  "frontend/src/pages/admin/PackageManagement.tsx": "Admin page for managing course packages, supporting add, edit, delete, and toggle-active-status operations via a table UI with a modal form.",
  "frontend/src/pages/admin/PaymentManagement.tsx": "Admin page for reviewing payment proofs submitted by users, allowing filtering by status and approving or rejecting individual proofs.",
  "frontend/src/pages/admin/SiteContentManagement.tsx": "Admin page for editing persistent site content including WhatsApp number, PhonePe UPI details, and bank details with QR code image uploads.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for managing registered users with search by name or phone, block/unblock toggle, and delete functionality.",
  "frontend/src/pages/admin/WithdrawalManagement.tsx": "Admin page for viewing and managing user withdrawal requests, with filtering by status and approve/reject actions via backend mutations.",
  "frontend/src/pages/AdminLogin.tsx": "Provides an admin-only login page that uses Internet Identity authentication and redirects to the admin panel if the user has admin privileges, or denies access otherwise.",
  "frontend/src/pages/Contact.tsx": "Renders the Contact page with WhatsApp and phone contact options, a contact interest form, and supporting layout components like Header, Footer, and a floating WhatsApp button.",
  "frontend/src/pages/LandingPagePreview.tsx": "Fetches and displays a landing page by ID from the backend, increments its visit count on load, and renders its HTML content with a loading and 404 error state.",
  "frontend/src/pages/Login.tsx": "Renders the user login page using Internet Identity authentication, redirecting authenticated users to the dashboard and showing relevant alerts and a remember-me checkbox.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Displays the Privacy Policy page with scroll-animated sections covering data collection, usage, and user rights, and sets relevant SEO meta tags on mount.",
  "frontend/src/pages/RefundPolicy.tsx": "Displays Evergreen Hub's refund policy page with animated sections, emphasizing a strict no-refund policy for digital products with limited exceptions. Sets page metadata (title, description, keywords) on mount.",
  "frontend/src/pages/Register.tsx": "User registration page that authenticates via Internet Identity, validates form fields (name, email, phone, password), and registers the user on the ICP backend with optional referral link support.",
  "frontend/src/pages/TermsOfService.tsx": "Renders Evergreen Hub's Terms of Service page with scroll-animated sections covering acceptance of terms, eligibility, and platform usage rules. Sets relevant SEO metadata on mount.",
  "frontend/src/pages/user/ChangePassword.tsx": "Static informational page explaining that the platform uses Internet Identity for passwordless authentication, with a link to identity.ic0.app.",
  "frontend/src/pages/user/DashboardOverview.tsx": "User dashboard overview page displaying earnings, payment proofs, packages, referral link, and a commission chart, with an animated rising-bubbles background effect.",
  "frontend/src/pages/user/LandingPageBuilder.tsx": "User page for creating, editing, and deleting landing pages with a form for title, content, and template selection, backed by query/mutation hooks.",
  "frontend/src/pages/user/MyLandingPages.tsx": "User page listing all their created landing pages in a table with options to preview, edit, or delete each page, including a confirmation dialog for deletion.",
  "frontend/src/pages/user/MyPackages.tsx": "User page displaying all purchased packages and their payment proof statuses (approved, pending, rejected) fetched from the backend.",
  "frontend/src/pages/user/ProfileSettings.tsx": "React page component for user profile settings, allowing users to update their name, phone number, and upload a profile photo with preview and validation.",
  "frontend/src/pages/user/WithdrawalRequests.tsx": "React page component for submitting and viewing withdrawal requests, which also opens a WhatsApp message to notify the admin upon successful submission.",
  "frontend/src/pages/WebDesignServices.tsx": "Web design services landing page showcasing five pricing packages, customer testimonials, and an FAQ section, with a payment modal triggered on package selection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and hash cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH-based color tokens, border radius, box shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata for Evergreen Hub describing existing features (hidden WhatsApp number, hidden UPI ID in payment flows) and pending feature requests with architectural notes."
}