{
  "backend/main.mo": "Main backend actor defining types (UserProfile, Package, Payment, etc.) and state management for users, packages, payments, withdrawal requests, landing pages, and products with Stripe integration, authorization mixins, and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to remove the 'Buy Course' button from HeroSection.tsx while keeping the 'Explore Courses' button and maintaining existing layout and styling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including landing page sections, authentication pages, user/admin dashboards, and styling configurations with detailed descriptions of functionality and visual design.",
  "frontend/index.css": "Tailwind CSS configuration with comprehensive light and dark mode color systems using CSS custom properties, including smooth transitions and theme-specific styling for all UI elements.",
  "frontend/index.html": "HTML entry point with SEO-optimized meta tags for Evergreen Hub affiliate marketing website, including Open Graph and Twitter card metadata.",
  "frontend/src/App.tsx": "Main application router setup with TanStack Router, integrating landing page components (HeroSection, PricingSection, etc.), authentication pages, user/admin dashboards, and global providers (Auth, Theme, QueryClient).",
  "frontend/src/components/admin/ImageModal.tsx": "Dialog component that displays a payment screenshot image in a modal overlay with zoom-friendly max dimensions.",
  "frontend/src/components/admin/PackageModal.tsx": "Modal dialog component for creating and editing course packages with form fields for name, price, and courses, using React Query mutations to interact with the backend actor.",
  "frontend/src/components/AppearanceSettingsModal.tsx": "Modal dialog component for theme selection (system/light/dark) with radio buttons and visual icons, allowing users to change appearance settings.",
  "frontend/src/components/BottomCTASection.tsx": "Call-to-action section with heading, description, and 'Explore Our Courses' button that smoothly scrolls to the courses section.",
  "frontend/src/components/CountdownBanner.tsx": "A sticky countdown timer banner component that displays a 24-hour countdown with hours, minutes, and seconds, resetting when it reaches zero. Uses emerald gradient styling and animates with a pulsing clock icon.",
  "frontend/src/components/CoursePackagesModal.tsx": "A modal dialog component that displays available course packages in a grid layout with pricing, features, and images. Handles package selection and opens a PaymentModal when a package is chosen.",
  "frontend/src/components/EvergreenAIChatbot.tsx": "A floating chatbot component with a collapsible chat window that provides automated responses about courses, packages, pricing, and payments. Features a message history, typing indicator, and rule-based response generation.",
  "frontend/src/components/FAQSection.tsx": "An accordion-based FAQ section component displaying five common questions about affiliate marketing with scroll animations. Covers topics like experience requirements, results timeline, support, and earning potential.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "A fixed floating button component that links to WhatsApp with a pre-filled message. Displays a masked phone number and uses emerald styling with hover effects.",
  "frontend/src/components/Footer.tsx": "A comprehensive footer component with three columns containing brand info, quick links, and legal links. Includes social media icons for Facebook, Instagram, and YouTube, plus copyright information.",
  "frontend/src/components/GradientBlobs.tsx": "A decorative component that renders three animated gradient blob elements as a fixed background overlay. Uses CSS classes for styling and positioning.",
  "frontend/src/components/Header.tsx": "A responsive header component with navigation, authentication controls, and theme toggle. Features a sticky header with scroll effects, mobile sidebar toggle, and conditional rendering based on auth state and admin role.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with gradient background, headline, subheadline, and a button that scrolls to the courses section. Includes dark mode gradient glow effects.",
  "frontend/src/components/InstagramSection.tsx": "Instagram promotional section with gradient styling, profile link, and two CTA buttons to follow the Instagram account. Uses scroll animation hook for fade-in effect.",
  "frontend/src/components/MobileSidebar.tsx": "Mobile navigation sidebar with sheet component containing navigation links (Home, Courses accordion, About, Contact), theme toggle, and authentication-based action buttons.",
  "frontend/src/components/PaymentGateway.tsx": "Displays PhonePe QR code and masked bank account details (India Post Payment Bank) with payment instructions for manual transfers.",
  "frontend/src/components/PaymentModal.tsx": "Modal dialog for completing purchases that combines PaymentGateway and PaymentProofForm components, handles payment proof submission via actor mutation.",
  "frontend/src/components/PaymentProofForm.tsx": "Form for submitting payment proof with transaction ID and screenshot upload (max 5MB), includes upload progress tracking, WhatsApp support link, and success/error states.",
  "frontend/src/components/PricingSection.tsx": "Displays six course packages (E-LITE to ULTRA PRO) with pricing, descriptions, and course lists. Handles authentication checks and opens PaymentModal when users click 'Buy Now'.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards routes by checking authentication and admin status, redirecting unauthorized users to login pages. Shows loading spinner during initialization and handles profile setup requirements.",
  "frontend/src/components/ScrollToTopButton.tsx": "Renders a fixed floating button that appears after scrolling 300px down and smoothly scrolls the page back to top when clicked.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays three customer testimonials in a grid layout with ratings, images, and quotes. Uses scroll animation hook for fade-in effect.",
  "frontend/src/components/ThemeToggleSwitch.tsx": "Provides a button to toggle between light and dark themes with animated sun/moon icons using the ThemeContext.",
  "frontend/src/components/TrustBadgesSection.tsx": "Shows four trust indicators (1000+ Students, Expert Instructors, 24/7 Support, Money-Back Guarantee) with icons in a horizontal layout.",
  "frontend/src/components/VideoEditingSection.tsx": "Promotes a ₹500 video editing service with feature cards, order button that opens PaymentModal, and WhatsApp contact link. Includes scroll animation.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Displays four benefit cards (Beginner Friendly, Step-by-Step Guidance, Lifetime Access, WhatsApp Support) explaining why to choose Evergreen Hub. Uses scroll animation.",
  "frontend/src/components/YouTubeSection.tsx": "Embeds YouTube channel content with an iframe and provides a subscribe button linking to @evergreengamerz channel. Includes scroll animation.",
  "frontend/src/contexts/AuthContext.tsx": "Authentication context provider that manages user authentication state, profile data, admin status, and provides login/logout functions using Internet Identity and backend actor integration.",
  "frontend/src/contexts/ThemeContext.tsx": "Theme context provider that manages light/dark/system theme preferences with localStorage persistence and applies theme classes to the document root.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, handling actor initialization and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient creation, login/logout flow, identity state, and delegation validation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching data from the backend including packages, payment proofs, user profiles, admin stats, earnings, withdrawal requests, and landing pages.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to detect when an element enters the viewport, useful for triggering scroll-based animations with configurable threshold and trigger options.",
  "frontend/src/index.css": "Global CSS file defining Tailwind directives, CSS custom properties for light/dark themes using OKLCH color system, and utility classes for shadows, transitions, and layout.",
  "frontend/src/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout with sidebar navigation for stats, users, packages, payments, and withdrawals; includes mobile sheet menu and protected route wrapper requiring admin role.",
  "frontend/src/layouts/UserDashboardLayout.tsx": "User dashboard layout with sidebar navigation for home, dashboard, packages, withdrawals, landing page builder, profile, and password settings; includes appearance modal and mobile sheet menu.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AboutUs.tsx": "About Us page with scroll animations, SEO meta tags, and sections describing Evergreen Hub's mission to empower users through digital learning and affiliate marketing.",
  "frontend/src/pages/admin/AdminStats.tsx": "Admin dashboard statistics page displaying total users, sales, revenue, and pending payments in card widgets with auto-refresh every 30 seconds.",
  "frontend/src/pages/admin/PackageManagement.tsx": "Admin page for managing course packages with a table view supporting add, edit, delete, and toggle status operations via modal dialogs.",
  "frontend/src/pages/admin/PaymentManagement.tsx": "Admin page for reviewing payment proofs with filtering by status, viewing screenshots, and approving or rejecting payment submissions.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for managing users with search functionality, displaying user details in a table, and supporting block/unblock and delete operations.",
  "frontend/src/pages/admin/WithdrawalManagement.tsx": "Admin page for managing user withdrawal requests with filtering, approval/rejection actions, and status updates using React Query mutations.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page using Internet Identity authentication with role verification; redirects to admin dashboard if authorized or user dashboard if not.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying WhatsApp and phone contact options with call-to-action buttons for user support and enrollment inquiries.",
  "frontend/src/pages/Login.tsx": "Login page component that authenticates users via Internet Identity, displays a login form with remember-me checkbox, and redirects authenticated users to the dashboard.",
  "frontend/src/pages/Register.tsx": "Registration page component with form validation for name, email, phone, and password fields that authenticates via Internet Identity and registers users with the backend actor.",
  "frontend/src/pages/user/ChangePassword.tsx": "Informational page explaining that password management is handled through Internet Identity's cryptographic authentication system rather than traditional passwords.",
  "frontend/src/pages/user/DashboardOverview.tsx": "User dashboard displaying earnings statistics (today, weekly, monthly, total), payment proofs, and package purchase summaries with status badges.",
  "frontend/src/pages/user/LandingPageBuilder.tsx": "User interface for creating, editing, and deleting custom landing pages with title, content, and template selection using CRUD mutations.",
  "frontend/src/pages/user/MyPackages.tsx": "Displays user's purchased packages with payment proof details, transaction IDs, and approval status badges.",
  "frontend/src/pages/user/ProfileSettings.tsx": "User profile settings page allowing updates to name and phone number while displaying read-only email field.",
  "frontend/src/pages/user/WithdrawalRequests.tsx": "User-facing page for creating and viewing withdrawal requests with form inputs for amount and message, table display of request history with status badges (approved/pending/rejected), and React Query integration for data fetching and mutations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system with CSS variables, custom animations (accordion), typography and container query plugins, and Inter font family setup.",
  "project_state.json": "Project metadata tracking Evergreen Hub affiliate marketing platform features including hero section, pricing packages (₹699-₹14999), YouTube integration, WhatsApp support, and blue/orange color scheme with dark mode support."
}