{
  "backend/main.mo": "Main actor implementing user registration, profile management, package/payment CRUD, admin stats, payment proof submission with blob storage, role-based access control, and user blocking functionality.",
  "backend/migration.mo": "Migration module defining type schemas for UserProfile, Package, Payment, PaymentProof and OldActor state, with a run function that currently returns the old actor unchanged.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: Skills Bazzar logo replacement, PaymentGateway component with bank details, payment proof submission form, and payment modal integration with PricingSection.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, authentication, landing page sections, user/admin dashboards, and payment flow components with Skills Bazzar branding.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining emerald green and black theme variables for both light and dark modes.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Open Graph, and Twitter card metadata for Evergreen Hub affiliate marketing website.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup defining routes for landing page, authentication, contact, user dashboard, and admin dashboard with QueryClient and AuthProvider wrappers.",
  "frontend/src/components/admin/ImageModal.tsx": "Dialog modal component for displaying full-size payment screenshot images in the admin interface with responsive sizing and close functionality.",
  "frontend/src/components/admin/PackageModal.tsx": "Modal dialog component for creating and editing course packages with form fields for name, price, and courses; uses React Query mutations to call backend actor methods.",
  "frontend/src/components/CountdownBanner.tsx": "Sticky countdown timer banner displaying a 24-hour countdown with emerald green styling to create urgency for limited-time offers.",
  "frontend/src/components/FAQSection.tsx": "Displays a collapsible FAQ accordion section with five common questions about affiliate marketing, experience requirements, results timeline, support options, and earning potential.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Renders a fixed floating button in the bottom-right corner that opens WhatsApp with a pre-filled message to contact +919263989760.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with brand info, social media links (YouTube, Instagram, WhatsApp), contact details, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Renders the sticky header with logo/brand, navigation, and authentication UI showing login/register buttons for guests or a dropdown menu with dashboard/admin links and logout for authenticated users.",
  "frontend/src/components/HeroSection.tsx": "Displays the main hero section with background image, Evergreen Hub branding, headline about online earning, and CTA buttons to buy courses or chat on WhatsApp.",
  "frontend/src/components/InstagramSection.tsx": "Promotes the Instagram account @rajput.rudra_s with gradient styling, Instagram logo, and buttons to follow or connect on the platform.",
  "frontend/src/components/PaymentGateway.tsx": "Displays India Post Payment Bank account details (account number, IFSC, holder name) and payment instructions for bank transfer in a styled card layout.",
  "frontend/src/components/PaymentModal.tsx": "Modal dialog for completing course purchases that shows package details, payment gateway info, and a form to submit payment proof with transaction ID and screenshot using React Query mutations.",
  "frontend/src/components/PaymentProofForm.tsx": "Form component for users to submit payment proof with transaction ID and screenshot upload, includes file validation (image type, 5MB max), upload progress tracking, and success/error handling.",
  "frontend/src/components/PricingSection.tsx": "Displays six course packages (E-LITE to ULTRA PRO, ₹699-₹14999) with pricing cards, course lists, and buy buttons that trigger PaymentModal for authenticated users or redirect to login.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and admin privileges, redirects unauthorized users to login, and shows loading state during initialization.",
  "frontend/src/components/TestimonialsSection.tsx": "Static testimonials section displaying three student success stories with 5-star ratings, avatars, and quotes about their experience with Evergreen Hub.",
  "frontend/src/components/VideoEditingSection.tsx": "Marketing section promoting professional long video editing service at ₹500 per video with a WhatsApp contact button for ordering.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Static benefits section showcasing four key features (beginner-friendly training, step-by-step guidance, lifetime access, WhatsApp support) with icons and descriptions.",
  "frontend/src/components/YouTubeSection.tsx": "YouTube channel promotion section with embedded video player, channel link (@evergreengamerz), and subscribe button that opens the channel in a new tab.",
  "frontend/src/contexts/AuthContext.tsx": "Authentication context provider that manages user identity, profile, admin status, and login/logout flows using Internet Identity and backend actor; provides auth state to child components.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches the backend actor instance based on Internet Identity authentication state, initializing access control with admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login status, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, muted, destructive, and chart color definitions.",
  "frontend/src/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout with protected routing, responsive sidebar navigation for stats/users/packages/payments, and logout functionality; requires admin authentication.",
  "frontend/src/layouts/UserDashboardLayout.tsx": "User dashboard layout with protected routing, responsive sidebar navigation for dashboard/packages/profile/password, and logout functionality; requires user authentication.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component into the DOM.",
  "frontend/src/pages/admin/AdminStats.tsx": "Admin dashboard statistics page displaying total users, sales, revenue, and pending payments in card widgets with auto-refresh.",
  "frontend/src/pages/admin/PackageManagement.tsx": "Admin interface for managing course packages with CRUD operations, status toggling, and a table view of all packages.",
  "frontend/src/pages/admin/PaymentManagement.tsx": "Admin page for managing payment proofs with filtering by status, viewing screenshots, and approving/rejecting submissions. Displays payment details in a table with user and package information.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for managing users with search functionality, ability to toggle user block status, and delete users. Displays user information including name, email, phone, role, and status in a table.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that authenticates users via Internet Identity and verifies admin role before granting access to the admin dashboard.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying WhatsApp and phone contact options with a call-to-action for starting the affiliate marketing journey.",
  "frontend/src/pages/Login.tsx": "User login page that authenticates via Internet Identity with remember-me option and redirects authenticated users to the dashboard.",
  "frontend/src/pages/Register.tsx": "Registration page with form validation that authenticates via Internet Identity and registers user details (name, email, phone) with the backend.",
  "frontend/src/pages/user/ChangePassword.tsx": "Informational page explaining that password management is handled through Internet Identity authentication system, not traditional passwords. Provides guidance on managing authentication credentials.",
  "frontend/src/pages/user/DashboardOverview.tsx": "User dashboard displaying overview statistics including total packages, total spent, pending payments, and approved payments. Shows recent payment proofs with status badges.",
  "frontend/src/pages/user/MyPackages.tsx": "User page displaying all purchased packages with payment status, transaction IDs, and pricing information. Shows empty state when no packages have been purchased.",
  "frontend/src/pages/user/ProfileSettings.tsx": "User profile settings page allowing users to update their name and phone number. Email field is displayed but disabled as it cannot be changed.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, animations, font families (Inter), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for Evergreen Hub affiliate marketing website, tracking implemented features including hero section, 6-tier pricing packages, YouTube integration, video editing services, WhatsApp lead generation, and authentication system with green/black theme."
}