{
  "backend/main.mo": "Main actor defining types (UserProfile, Package, Payment, PaymentProof, Earnings, WithdrawalRequest, LandingPage, Product) and state maps for users, packages, payments, earnings, withdrawals, landing pages, and products. Includes authorization, blob storage mixins, Stripe integration, and migration support.",
  "backend/migration.mo": "Migration module that transforms OldActor state to NewActor state by adding userEarnings, withdrawalRequests, and landingPages maps with their corresponding ID counters while preserving existing data.",
  "feature_evidence.json": "Feature evidence report documenting five UI changes: PaymentModal solid black background, EvergreenAIChatbot solid black background, chatbot button repositioning to left side, FloatingWhatsAppButton solid black background, and phone number masking to show only last 2 digits (60) while maintaining clickability.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including routing, authentication, dashboards, landing page sections, animations, styling, and WhatsApp integration with masked phone number (********60) linking to 9263989760.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark themes, including background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with SEO meta tags (title, description, keywords), Open Graph and Twitter card metadata for 'Evergreen Hub - Learn. Earn. Grow.' affiliate marketing website.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup defining routes for landing page, authentication (register/login/admin-login), contact, about-us, user dashboard (overview, packages, profile, password, withdrawals, landing page builder), and admin dashboard (stats, users, packages, payments, withdrawals). Includes ThemeProvider, AuthProvider, QueryClientProvider, and global components.",
  "frontend/src/components/admin/ImageModal.tsx": "A dialog modal component that displays a payment screenshot image in a centered, responsive layout with max dimensions.",
  "frontend/src/components/admin/PackageModal.tsx": "A dialog form component for creating or editing course packages with fields for name, price, and courses. Handles both create and update mutations with validation and toast notifications.",
  "frontend/src/components/AppearanceSettingsModal.tsx": "A modal dialog component for theme selection (system, light, dark) using radio buttons with icons and descriptions. Integrates with ThemeContext to persist user theme preferences.",
  "frontend/src/components/CountdownBanner.tsx": "A sticky banner displaying a countdown timer (hours:minutes:seconds) with emerald gradient styling to create urgency for limited-time offers. Timer resets to 23:59:59 when it reaches zero.",
  "frontend/src/components/CoursePackagesModal.tsx": "A modal displaying course packages in a grid layout with pricing, features, and images. Handles package selection and opens PaymentModal for checkout, with special highlighting for popular packages.",
  "frontend/src/components/EvergreenAIChatbot.tsx": "A draggable floating chatbot widget with rule-based responses for FAQs about courses, packages, pricing, and support. Features animated border, message history, and mobile-friendly touch interactions.",
  "frontend/src/components/FAQSection.tsx": "An accordion-based FAQ section displaying common questions about affiliate marketing, experience requirements, results timeline, support, and earning potential. Uses scroll animation for reveal effects.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "A fixed-position floating button linking to WhatsApp with a pre-filled message and masked phone number display. Features hover animations and floating effects.",
  "frontend/src/components/Footer.tsx": "A footer component with brand information, social media links (Facebook, Instagram, YouTube), quick navigation links, and decorative animated floating dots. Includes copyright and made-with-love attribution.",
  "frontend/src/components/Header.tsx": "Main navigation header component with responsive design, featuring logo, theme toggle, authentication state handling, and dropdown menus for user/admin accounts with mobile sidebar support.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with animated background, call-to-action buttons for course purchase and WhatsApp contact, and trust indicators showing student count, courses, and support availability.",
  "frontend/src/components/InstagramSection.tsx": "Instagram profile promotion section with animated card displaying username, follow button, and gradient styling using scroll-based visibility animations.",
  "frontend/src/components/MobileSidebar.tsx": "Mobile-only slide-out navigation drawer with theme-aware gradient backgrounds, decorative animations, and navigation links for home, about, courses, and dashboard access.",
  "frontend/src/components/PaymentGateway.tsx": "Payment information display component showing PhonePe QR code, masked bank account details (India Post Payment Bank), and step-by-step payment instructions for users.",
  "frontend/src/components/PaymentModal.tsx": "Modal dialog for completing course purchases, integrating PaymentGateway and PaymentProofForm components with mutation handling for submitting payment proof to the backend actor.",
  "frontend/src/components/PaymentProofForm.tsx": "Form component for submitting payment proof with transaction ID and screenshot upload, includes progress tracking, validation, and WhatsApp support link.",
  "frontend/src/components/PricingSection.tsx": "Displays six course packages (E-lite to Ultra Pro) with pricing from ₹699 to ₹14999, handles authentication-gated purchases and opens payment modal.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login and enforces admin-only access for specific routes.",
  "frontend/src/components/ScrollToTopButton.tsx": "Floating button that appears after scrolling 300px down and smoothly scrolls the page back to top when clicked.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays three customer testimonials with 5-star ratings in a grid layout with scroll animation effects.",
  "frontend/src/components/ThemeToggleSwitch.tsx": "Button component that toggles between light and dark themes with animated sun/moon icons.",
  "frontend/src/components/VideoEditingSection.tsx": "Marketing section for ₹500 video editing service showcasing four features with payment modal and WhatsApp contact integration.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Displays four benefit cards (beginner training, guidance, lifetime access, WhatsApp support) with images and scroll animations.",
  "frontend/src/components/YouTubeSection.tsx": "Displays a YouTube channel section with an embedded video player, channel information, and a subscribe button linking to the Evergreen Hub YouTube channel. Uses scroll animation hook for fade-in effect.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context managing Internet Identity login/logout, user profile state, admin status, and profile refresh functionality. Integrates with actor and query client for data management.",
  "frontend/src/contexts/ThemeContext.tsx": "Manages theme state (light/dark/system) with localStorage persistence and system preference detection. Applies theme classes to document root element.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, handling both anonymous and authenticated states. Initializes access control and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking. Creates AuthClient with configurable options and handles identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching backend data including packages, payment proofs, user profiles, admin stats, earnings, withdrawal requests, and landing pages. All queries depend on actor availability.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to detect when an element enters viewport and trigger visibility state changes. Supports configurable threshold, root margin, and single/repeated triggering.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light/dark theme colors using OKLCH color space, and includes custom keyframe animations for hero sections, buttons, and UI effects like fade-in, zoom, glow, and ripple.",
  "frontend/src/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout component with a sidebar navigation for dashboard stats, user management, package management, payment management, and withdrawal management. Includes mobile responsive sheet menu and requires admin authentication via ProtectedRoute.",
  "frontend/src/layouts/UserDashboardLayout.tsx": "User dashboard layout component with sidebar navigation for home, dashboard, packages, withdrawal requests, landing page builder, profile settings, and password change. Features appearance settings modal and mobile responsive design with authentication protection.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching, InternetIdentityProvider for authentication, and renders the main App component.",
  "frontend/src/pages/AboutUs.tsx": "About Us page component that describes Evergreen Hub as a digital learning and earning platform, uses scroll animations for sections, and includes SEO meta tags. Features Header, Footer, FloatingWhatsAppButton, EvergreenAIChatbot, and ScrollToTopButton components.",
  "frontend/src/pages/admin/AdminStats.tsx": "Admin dashboard statistics page displaying total users, sales, revenue, and pending payments in card widgets with auto-refresh every 30 seconds.",
  "frontend/src/pages/admin/PackageManagement.tsx": "Admin page for managing course packages with a table view, add/edit/delete functionality, status toggle switches, and a modal for package creation/editing.",
  "frontend/src/pages/admin/PaymentManagement.tsx": "Admin page for reviewing payment proofs with filtering by status, approve/reject actions, screenshot viewing modal, and displays user and package information.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for managing users with search functionality, user blocking toggle, delete confirmation dialog, and displays user details in a table format.",
  "frontend/src/pages/admin/WithdrawalManagement.tsx": "Admin page for managing user withdrawal requests with filtering, approval/rejection actions, and status updates using React Query mutations.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that authenticates users via Internet Identity and verifies admin role before allowing access to admin dashboard. Redirects non-admin users to regular dashboard and shows loading states during authentication.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying WhatsApp and phone contact options with call-to-action buttons. Includes Header, Footer, InstagramSection, and FloatingWhatsAppButton components with a gradient card layout for contact methods.",
  "frontend/src/pages/Login.tsx": "Login page component that authenticates users via Internet Identity, displays a login form with remember-me checkbox, and redirects authenticated users to the dashboard.",
  "frontend/src/pages/Register.tsx": "Registration page component that validates user input (name, email, phone, password), authenticates via Internet Identity, then registers the user with the backend actor.",
  "frontend/src/pages/user/ChangePassword.tsx": "Informational page explaining that password management is handled through Internet Identity's cryptographic authentication system rather than traditional passwords.",
  "frontend/src/pages/user/DashboardOverview.tsx": "User dashboard displaying earnings statistics (today, weekly, monthly, total), payment proofs, and package purchase summaries with status badges.",
  "frontend/src/pages/user/LandingPageBuilder.tsx": "User interface for creating, editing, and deleting custom landing pages with title, content, and template selection using CRUD mutations.",
  "frontend/src/pages/user/MyPackages.tsx": "Displays user's purchased packages with payment proof details, transaction IDs, and approval status badges.",
  "frontend/src/pages/user/ProfileSettings.tsx": "User profile editing form allowing updates to name and phone number while displaying read-only email field.",
  "frontend/src/pages/user/WithdrawalRequests.tsx": "User page for creating and viewing withdrawal requests with form inputs for amount and message, table displaying request history with status badges (approved/pending/rejected), and React Query integration for data fetching and mutations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including animations, typography, container queries, and Inter font family setup.",
  "project_state.json": "Project metadata defining Evergreen Hub as an affiliate marketing website with green/black theme, listing architectural notes, existing features including hero section, pricing packages, YouTube integration, and WhatsApp contact functionality."
}