{
  "backend/main.mo": "Main backend actor defining types (UserProfile with profilePhotoUrl, Package, Payment, Referral, LandingPage, etc.), state maps, and business logic for user management, payments, referrals, withdrawals, landing pages, Stripe integration, and blob storage with access control.",
  "backend/migration.mo": "Migration module that transforms OldUserProfile to NewUserProfile by adding a profilePhotoUrl field (initialized to null) while preserving all other user data.",
  "feature_evidence.json": "Feature evidence report documenting four features for profile photo upload/display functionality across ProfileSettings page, useQueries hook, MobileSidebar, and UserDashboardLayout with high confidence test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including landing page sections, dashboard layouts, auth flows, and routing structure with details on styling, animations, and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with comprehensive light and dark mode color systems using CSS custom properties for theme switching, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point with SEO meta tags (title, description, keywords, Open Graph, Twitter cards) for Evergreen Hub affiliate marketing website and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup defining routes for landing page, auth pages, user dashboard (including MyLandingPages), admin dashboard, legal pages, and public landing page preview, wrapped in Theme, Auth, and QueryClient providers.",
  "frontend/src/components/admin/ImageModal.tsx": "A dialog modal that displays a payment screenshot image in a centered, responsive container.",
  "frontend/src/components/admin/PackageModal.tsx": "A form dialog for creating or editing course packages with fields for name, price, and courses, using React Query mutations.",
  "frontend/src/components/AppearanceSettingsModal.tsx": "Modal dialog for theme selection (light/dark/system) with radio group options, icons, and save/cancel actions using ThemeContext.",
  "frontend/src/components/BottomCTASection.tsx": "Call-to-action section with heading, description, and button that smoothly scrolls to the courses section.",
  "frontend/src/components/CommissionChart.tsx": "Card component displaying a table of package commission data with active and passive income columns, plus explanatory notes.",
  "frontend/src/components/CountdownBanner.tsx": "Sticky banner with a countdown timer (hours:minutes:seconds) for a limited-time offer, auto-resets after reaching zero.",
  "frontend/src/components/CoursePackagesModal.tsx": "Modal displaying available course packages in a grid with pricing, features, and purchase buttons that open a PaymentModal.",
  "frontend/src/components/EvergreenAIChatbot.tsx": "Floating chatbot button and dialog with message history, user input, and rule-based bot responses for course/payment inquiries.",
  "frontend/src/components/FacebookSection.tsx": "Displays a promotional section encouraging users to follow the Evergreen Hub Facebook page with animated card, social icons, and call-to-action buttons. Uses scroll animation hook for fade-in effects.",
  "frontend/src/components/FAQSection.tsx": "Accordion-based FAQ section with scroll animation, displaying common questions about affiliate marketing and courses.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Renders a fixed floating WhatsApp contact button in the bottom-right corner with a masked phone number and pre-filled message. Opens WhatsApp chat in a new tab when clicked.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with brand information, social media links (Facebook, Instagram, YouTube), quick navigation links, and legal links. Includes copyright notice and app identifier.",
  "frontend/src/components/GradientBlobs.tsx": "Renders three animated gradient blob elements as fixed background decorations with pointer-events disabled. Used for visual aesthetics across the application.",
  "frontend/src/components/Header.tsx": "Main navigation header with responsive design, featuring logo, navigation links, theme toggle, and authentication controls. Includes mobile sidebar toggle and scroll-based styling changes.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with headline, subheadline, and call-to-action button that smoothly scrolls to the courses section. Features gradient background with dark mode support.",
  "frontend/src/components/InstagramSection.tsx": "Promotional section for Instagram profile with animated card, gradient styling, and follow buttons. Uses scroll animation hook for entrance effects and links to @rajput.rudra_s.",
  "frontend/src/components/MobileSidebar.tsx": "Mobile navigation sidebar with user profile display, navigation links, package accordion, theme toggle, and authentication controls. Handles smooth scrolling to page sections and logout functionality.",
  "frontend/src/components/MyReferralLink.tsx": "Displays the user's unique referral link with copy-to-clipboard functionality and a tip for sharing on social media.",
  "frontend/src/components/PaymentGateway.tsx": "Shows PhonePe QR code and masked bank account details (India Post Payment Bank) with payment instructions for manual transfers.",
  "frontend/src/components/PaymentModal.tsx": "Modal dialog that combines PaymentGateway and PaymentProofForm to handle package purchase flow with payment proof submission.",
  "frontend/src/components/PaymentProofForm.tsx": "Form for submitting payment proof with transaction ID and screenshot upload, includes progress tracking and WhatsApp support link.",
  "frontend/src/components/PricingSection.tsx": "Displays six course packages (E-LITE to ULTRA PRO) with expandable details and integrated payment submission flow for authenticated users.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and admin privileges, redirecting unauthorized users with toast notifications.",
  "frontend/src/components/ReferralsSection.tsx": "Shows referral statistics with three commission cards (active, passive, pending) and a list of referrals with package details and status badges.",
  "frontend/src/components/ScrollToTopButton.tsx": "A fixed button that appears when scrolling past 300px and smoothly scrolls the page back to the top when clicked.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays a grid of three student testimonials with ratings, images, and quotes, using scroll animation for fade-in effect.",
  "frontend/src/components/ThemeToggleSwitch.tsx": "A button that toggles between light and dark themes with animated sun/moon icons.",
  "frontend/src/components/TrustBadgesSection.tsx": "Displays four trust badges (1000+ Students, Expert Instructors, 24/7 Support, Money-Back Guarantee) with icons in a horizontal layout.",
  "frontend/src/components/VideoEditingSection.tsx": "Promotes a ₹500 professional video editing service with features, payment modal integration, and WhatsApp contact button.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Displays four benefit cards (Beginner Friendly, Step-by-Step Guidance, Lifetime Access, WhatsApp Support) in a responsive grid with scroll animation.",
  "frontend/src/components/YouTubeSection.tsx": "Embeds the Evergreen Hub YouTube channel with an iframe player and a subscribe button linking to the channel.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context with Internet Identity integration, user profile management, admin status checking, and login/logout functionality.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides a React context for managing theme state (light/dark/system) with localStorage persistence and automatic system theme detection. Applies theme classes to document root and body elements.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP login/logout functionality. Manages AuthClient lifecycle, identity persistence, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching backend data including packages, payment proofs, user profiles, admin stats, earnings, withdrawal requests, landing pages, and referrals. All queries depend on the authenticated actor instance.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to detect when elements enter the viewport for scroll-based animations. Supports configurable threshold, root margin, and single/repeated triggering.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom OKLCH color system for light and dark themes using blue-orange palette. Includes smooth theme transitions and utility classes for premium design elements.",
  "frontend/src/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout with responsive sidebar navigation for stats, users, packages, payments, and withdrawals. Includes protected route wrapper requiring admin privileges and mobile sheet menu.",
  "frontend/src/layouts/UserDashboardLayout.tsx": "Defines the user dashboard layout with a sidebar navigation menu, user profile display, appearance settings modal, and logout functionality. Uses ProtectedRoute to wrap the Outlet for authenticated access.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AboutUs.tsx": "About Us page component with scroll animations, SEO meta tags, and sections describing Evergreen Hub's mission to empower users through digital learning and affiliate marketing opportunities.",
  "frontend/src/pages/admin/AdminStats.tsx": "Admin dashboard statistics page displaying total users, sales, revenue, and pending payments in card layout with auto-refresh every 30 seconds.",
  "frontend/src/pages/admin/PackageManagement.tsx": "Admin package management interface with table view for CRUD operations on course packages, including status toggling, editing, and deletion with confirmation dialogs.",
  "frontend/src/pages/admin/PaymentManagement.tsx": "Admin page for managing payment proofs with filtering by status, viewing screenshots, and approving/rejecting submissions. Displays payment proofs in a table with user and package information.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page for managing users with search functionality, ability to toggle user block status, and delete users. Displays all registered users in a table with their details and roles.",
  "frontend/src/pages/admin/WithdrawalManagement.tsx": "Admin page for managing withdrawal requests with status filtering and approve/reject actions. Shows withdrawal requests in a table with user information and request details.",
  "frontend/src/pages/AdminLogin.tsx": "Admin-specific login page that authenticates via Internet Identity, verifies admin role, and redirects to admin dashboard or denies access based on user privileges.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying WhatsApp and phone contact options with call-to-action buttons for user support and engagement.",
  "frontend/src/pages/LandingPagePreview.tsx": "Displays a landing page by ID from URL params, increments visit count on load, sets SEO meta tags dynamically, and renders the page content as HTML.",
  "frontend/src/pages/Login.tsx": "User login page using Internet Identity authentication with remember me option, redirects authenticated users to dashboard, and provides link to registration.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Privacy policy page component that displays data protection information with scroll animations, SEO meta tags, and includes header, footer, chatbot, and WhatsApp button components.",
  "frontend/src/pages/RefundPolicy.tsx": "Refund policy page component displaying strict no-refund terms for digital products with prominent warning banner, scroll animations, and SEO optimization.",
  "frontend/src/pages/Register.tsx": "User registration page with form validation, Internet Identity authentication, referral link support, and backend user registration via actor integration.",
  "frontend/src/pages/TermsOfService.tsx": "Terms of service page component displaying user agreement, course access terms, and legal disclaimers with scroll animations and SEO meta tags.",
  "frontend/src/pages/user/ChangePassword.tsx": "User page for changing account password with form validation, password visibility toggles, and confirmation matching. Includes validation for password length and ensures new password differs from current.",
  "frontend/src/pages/user/DashboardOverview.tsx": "User dashboard displaying earnings overview, payment proof status, referral link, and commission charts. Shows statistics cards for daily/weekly/monthly/total earnings and lists approved/pending payment proofs.",
  "frontend/src/pages/user/LandingPageBuilder.tsx": "React component for creating, editing, and managing landing pages with form inputs for title, content, and template selection. Includes table view of existing pages with edit/delete actions and uses mutations for CRUD operations.",
  "frontend/src/pages/user/MyLandingPages.tsx": "Displays a table of user's landing pages with preview, edit, and delete actions. Includes navigation to builder page and confirmation dialog for deletions.",
  "frontend/src/pages/user/MyPackages.tsx": "Shows user's purchased packages with payment proof status (approved/pending/rejected), transaction IDs, and package details. Displays empty state when no packages exist.",
  "frontend/src/pages/user/ProfileSettings.tsx": "Profile management page allowing users to update name, phone, and upload profile photos with image validation (type and 5MB size limit). Uses ExternalBlob for photo URL handling.",
  "frontend/src/pages/user/WithdrawalRequests.tsx": "Handles withdrawal requests with form for amount and message, displays request history with status badges, and opens WhatsApp with pre-filled admin notification message upon submission.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container queries, typography plugin, custom animations, and Inter font family.",
  "project_state.json": "Project state file documenting Evergreen Hub affiliate marketing platform features, including hero section, pricing packages, YouTube integration, WhatsApp contact, and blue/orange color scheme with dark mode support."
}