{
  "backend/main.mo": "Main Motoko actor implementing user registration, profile management, package/payment handling, admin functions, and blob storage with role-based access control. Includes types for UserProfile, Package, Payment, PaymentProof, and AdminStats with authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting AboutUs page creation with six sections (500-700 words), responsive styling with emerald/black theme, ThemeContext integration, and routing setup with high confidence test mappings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components including App.tsx routing, animated sections (Hero, Pricing, Testimonials, FAQ), Header/Footer, authentication pages, user/admin dashboards, and utility components with scroll animations and theme support.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light/dark theme CSS variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with SEO meta tags (title, description, keywords), Open Graph and Twitter card metadata for Evergreen Hub affiliate marketing platform, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup defining routes for landing page, auth pages (register/login/admin-login), contact, about-us, user dashboard, and admin dashboard with ThemeProvider, AuthProvider, QueryClientProvider wrappers.",
  "frontend/src/components/admin/ImageModal.tsx": "Dialog modal component that displays payment screenshot images in a centered, responsive layout with max dimensions for optimal viewing.",
  "frontend/src/components/admin/PackageModal.tsx": "Modal component for creating and editing course packages with form fields for name, price, and courses; uses React Query mutations to create or update packages via the backend actor.",
  "frontend/src/components/AppearanceSettingsModal.tsx": "Dialog modal component for theme selection (system/light/dark) with radio buttons, icons (Sun/Moon/Monitor), and OK/Cancel actions that integrate with ThemeContext.",
  "frontend/src/components/CountdownBanner.tsx": "A sticky countdown timer banner component that displays a 24-hour countdown with hours, minutes, and seconds, resetting when it reaches zero. Uses emerald gradient styling and animates with a pulsing clock icon.",
  "frontend/src/components/CoursePackagesModal.tsx": "A modal dialog that displays available course packages in a grid layout, fetching data from an API and allowing users to select packages for purchase. Includes package images, pricing, course lists, and integrates with a PaymentModal component.",
  "frontend/src/components/EvergreenAIChatbot.tsx": "A draggable floating chatbot component with AI-powered responses about courses, packages, pricing, and account management. Features a collapsible chat interface with message history, drag-and-drop positioning, and animated border effects.",
  "frontend/src/components/FAQSection.tsx": "An accordion-based FAQ section component that displays common questions about affiliate marketing with scroll animations. Contains five predefined questions covering topics like experience requirements, results timeline, and support options.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "A fixed floating button positioned at the bottom-right corner that opens a WhatsApp chat with a predefined phone number and message. Features emerald green styling with hover effects and shadow animations.",
  "frontend/src/components/Footer.tsx": "A footer component with glassmorphism effects, animated glowing dots, and sections for quick links, legal links, and social media. Features theme-aware styling with gradient backgrounds and includes brand information and navigation links.",
  "frontend/src/components/Header.tsx": "A sticky header component with logo, navigation, theme toggle, and user authentication controls. Includes desktop dropdown menus and mobile sidebar integration, with role-based navigation for admin and regular users.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with animated background, brand headline, and CTA buttons for buying courses or contacting via WhatsApp. Includes ripple effect on button clicks and authentication-based navigation to course packages modal or login.",
  "frontend/src/components/InstagramSection.tsx": "Instagram promotional section displaying a profile link with animated card, gradient styling, and CTA buttons to follow or connect on Instagram. Uses scroll animation hook for fade-in effects.",
  "frontend/src/components/MobileSidebar.tsx": "Mobile sidebar drawer with navigation menu, theme toggle, and authentication-aware routing. Features glassmorphism design with animated decorative elements and collapsible courses dropdown.",
  "frontend/src/components/PaymentGateway.tsx": "Payment gateway display component showing PhonePe QR code and masked bank account details (India Post Payment Bank) with payment instructions for manual transfers.",
  "frontend/src/components/PaymentModal.tsx": "Modal dialog for completing course purchases, integrating PaymentGateway and PaymentProofForm components. Handles payment proof submission via actor mutation and displays package details.",
  "frontend/src/components/PaymentProofForm.tsx": "Form component for uploading payment proof with transaction ID and screenshot validation. Features file upload with progress tracking, converts images to ExternalBlob, and includes WhatsApp support option.",
  "frontend/src/components/PricingSection.tsx": "Displays six course packages (E-LITE to ULTRA PRO) with pricing from ₹699 to ₹14999, featuring course lists, buy buttons, and integration with PaymentModal. Includes authentication checks and scroll animations.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login and enforces admin-only access where required. Shows loading spinner during initialization and handles profile setup checks.",
  "frontend/src/components/ScrollToTopButton.tsx": "Fixed button that appears after scrolling 300px down the page and smoothly scrolls back to top when clicked. Uses ArrowUp icon with fade-in/out transitions.",
  "frontend/src/components/TestimonialsSection.tsx": "Displays three customer testimonials in a grid layout with 5-star ratings, avatars, and quotes. Includes scroll animation effects.",
  "frontend/src/components/ThemeToggleSwitch.tsx": "Button component that toggles between light and dark themes using sun/moon icons with smooth rotation animations. Integrates with ThemeContext.",
  "frontend/src/components/VideoEditingSection.tsx": "Promotes professional video editing service at ₹500 per video with two CTAs: WhatsApp order button and payment modal integration. Includes authentication checks and scroll animations.",
  "frontend/src/components/WhyChooseUsSection.tsx": "Showcases four key benefits (Beginner Friendly, Step-by-Step Guidance, Lifetime Access, WhatsApp Support) in a responsive card grid with images and descriptions. Includes scroll animations.",
  "frontend/src/components/YouTubeSection.tsx": "Embeds YouTube channel feed for @evergreengamerz with subscribe button linking to the channel. Features responsive video player and scroll animations.",
  "frontend/src/contexts/AuthContext.tsx": "Authentication context provider that manages user authentication state, profile data, and admin status using Internet Identity and backend actor; provides login, logout, and profile refresh functions.",
  "frontend/src/contexts/ThemeContext.tsx": "Theme context provider that manages light/dark/system theme preferences with localStorage persistence and system preference detection; applies theme classes to document root.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient lifecycle, login/logout flows, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching data from the backend including packages, payment proofs, user profiles, and admin statistics; all hooks depend on the actor being available.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to detect when elements enter viewport and trigger visibility state changes for scroll-based animations.",
  "frontend/src/index.css": "Global styles with Tailwind directives, CSS custom properties for light/dark themes using OKLCH color space, and keyframe animations for hero sections, CTAs, glows, and scroll effects.",
  "frontend/src/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout with sidebar navigation (stats, users, packages, payments), mobile sheet menu, and protected route wrapper requiring admin role.",
  "frontend/src/layouts/UserDashboardLayout.tsx": "User dashboard layout with sidebar navigation (home, dashboard, packages, profile, password, appearance), mobile sheet menu, and protected route wrapper for authenticated users.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AboutUs.tsx": "About Us page with scroll animations, SEO meta tags, and sections describing Evergreen Hub's mission to empower users with digital learning and earning opportunities.",
  "frontend/src/pages/admin/AdminStats.tsx": "Admin dashboard displaying key statistics (total users, sales, revenue, pending payments) fetched from backend with auto-refresh every 30 seconds.",
  "frontend/src/pages/admin/PackageManagement.tsx": "Admin interface for managing course packages with CRUD operations, status toggling, and a modal for adding/editing packages.",
  "frontend/src/pages/admin/PaymentManagement.tsx": "Admin page for reviewing payment proofs with filtering by status, approve/reject actions, and screenshot viewing functionality.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin interface for managing users with search functionality, user blocking/unblocking, and deletion capabilities.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page using Internet Identity with role verification, redirecting admins to dashboard or denying access to non-admin users.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying WhatsApp and phone contact options with call-to-action buttons for user support.",
  "frontend/src/pages/Login.tsx": "User login page using Internet Identity authentication with remember-me option and links to registration and password recovery.",
  "frontend/src/pages/Register.tsx": "User registration page with form validation for name, email, phone, password, and terms acceptance; integrates Internet Identity authentication and calls backend registerUser API.",
  "frontend/src/pages/user/ChangePassword.tsx": "Informational page explaining that password management is handled through Internet Identity's cryptographic authentication system.",
  "frontend/src/pages/user/DashboardOverview.tsx": "User dashboard overview page displaying statistics cards (total packages, total spent, pending payments, approved packages) and a recent activity table showing payment proofs with status badges.",
  "frontend/src/pages/user/MyPackages.tsx": "User page displaying all purchased packages with payment proof details including package name, price, transaction ID, submission date, and approval status with color-coded badges.",
  "frontend/src/pages/user/ProfileSettings.tsx": "User profile settings page with a form to update name and phone number, displaying email as read-only and using toast notifications for success/error feedback.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with container queries, typography plugin, custom animations, and Inter font family.",
  "project_state.json": "Project state document describing Evergreen Hub affiliate marketing website with green/black theme, listing architectural notes, existing features including hero section, pricing packages, YouTube integration, and WhatsApp contact system."
}