{
  "kind": "build_request",
  "title": "Remove Buy Course button from hero section, keep only Explore Courses button and background image",
  "projectName": "Evergreen Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-170",
      "text": "Remove the 'Buy Course' button from the HeroSection component (frontend/src/components/HeroSection.tsx), keeping only the 'Explore Courses' button visible. The button removal should not affect the existing hero section background image, layout, headline, or subheadline. Maintain the current styling and positioning of the remaining 'Explore Courses' button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Buy course wala option hata do first page se bss explore course wala rahne do or wo hero wala image rahne do first page pe"
        ]
      },
      "acceptanceCriteria": [
        "'Buy Course' button is completely removed from the hero section",
        "'Explore Courses' button remains visible and functional",
        "Hero section background image is preserved without changes",
        "Hero section headline and subheadline remain unchanged",
        "Smooth scroll functionality to courses section still works when 'Explore Courses' button is clicked",
        "Component renders correctly on mobile, tablet, and desktop viewports"
      ]
    }
  ],
  "constraints": [
    "Do not modify the hero section background image",
    "Do not change the HeroSection headline or subheadline text",
    "Maintain existing scroll animation and fade-in effects",
    "Preserve the CoursePackagesModal component functionality for use in other sections"
  ],
  "nonGoals": [
    "Removing the CoursePackagesModal component entirely",
    "Changing the 'Explore Courses' button styling or behavior",
    "Modifying other sections of the landing page",
    "Removing Buy Now buttons from the PricingSection cards"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}