{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update payment and chatbot backgrounds, reposition elements, mask phone number, add earnings dashboard and withdrawal requests",
  "requirements": [
    {
      "id": "REQ-121",
      "summary": "Change PaymentModal component background from transparent to solid black (#000000)",
      "acceptanceCriteria": [
        "PaymentModal background is solid black (#000000)",
        "Modal content remains visible with appropriate contrast",
        "Theme-aware styling preserved for text and elements"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PaymentModal.tsx",
          "operation": "modify",
          "description": "Update the DialogContent component styling to use solid black background (#000000) instead of transparent or semi-transparent background. Ensure text and UI elements maintain proper contrast for readability."
        }
      ]
    },
    {
      "id": "REQ-122",
      "summary": "Change EvergreenAIChatbot component background to solid black (#000000)",
      "acceptanceCriteria": [
        "Chatbot interface background is solid black (#000000)",
        "Chat messages and interface elements maintain readability",
        "Black background applies to both collapsed button and expanded chat interface"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EvergreenAIChatbot.tsx",
          "operation": "modify",
          "description": "Update the chatbot interface container styling to use solid black background (#000000) for both the collapsed floating button and the expanded chat interface. Ensure chat messages and UI elements remain readable with appropriate text colors."
        }
      ]
    },
    {
      "id": "REQ-123",
      "summary": "Reposition EvergreenAIChatbot floating button to the left side of the viewport",
      "acceptanceCriteria": [
        "Chatbot floating button appears on the left side of the viewport",
        "Button maintains appropriate spacing from left edge and bottom",
        "Draggable functionality continues to work after repositioning",
        "No overlap with FloatingWhatsAppButton on the right side"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EvergreenAIChatbot.tsx",
          "operation": "modify",
          "description": "Change the positioning from right side to left side by updating the fixed positioning styles (e.g., from 'right-4' to 'left-4'). Ensure the button maintains appropriate spacing from edges and draggable functionality remains intact."
        }
      ]
    },
    {
      "id": "REQ-124",
      "summary": "Update FloatingWhatsAppButton component background to solid black (#000000)",
      "acceptanceCriteria": [
        "FloatingWhatsAppButton has solid black background",
        "WhatsApp icon remains visible with appropriate contrast",
        "Hover effects and animations continue to work",
        "Button remains easily identifiable as WhatsApp contact"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FloatingWhatsAppButton.tsx",
          "operation": "modify",
          "description": "Update the button background styling to use solid black (#000000) while maintaining the WhatsApp icon visibility, hover effects, and animations."
        }
      ]
    },
    {
      "id": "REQ-125",
      "summary": "Mask phone number 9263989760 throughout the application to display only the last 2 digits as '********60'",
      "acceptanceCriteria": [
        "Phone number displays as '********60' wherever shown",
        "Masked number is clickable and opens WhatsApp with full number 9263989760",
        "Masking applied consistently across all components",
        "Clicking maintains existing pre-filled message functionality",
        "Visual styling indicates the number is clickable (hover effects, cursor pointer)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FloatingWhatsAppButton.tsx",
          "operation": "modify",
          "description": "Update the phone number display to show '********60' while keeping the WhatsApp link href using the full number 9263989760. Apply clickable styling with hover effects and cursor pointer."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update phone number display to show '********60' while keeping any clickable links using the full number 9263989760. Ensure the masked number is clickable with appropriate styling."
        },
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Update phone number display to show '********60' while keeping WhatsApp link functionality with the full number 9263989760. Apply clickable styling with hover effects."
        },
        {
          "path": "frontend/src/components/VideoEditingSection.tsx",
          "operation": "modify",
          "description": "Update phone number display to show '********60' while maintaining WhatsApp link functionality with the full number 9263989760. Apply clickable styling."
        },
        {
          "path": "frontend/src/components/PaymentProofForm.tsx",
          "operation": "modify",
          "description": "Update phone number display to show '********60' while keeping WhatsApp support link functionality with the full number 9263989760. Apply clickable styling."
        }
      ]
    },
    {
      "id": "REQ-126",
      "summary": "After successful login, redirect authenticated users directly to the user dashboard (/dashboard)",
      "acceptanceCriteria": [
        "Login page redirects to /dashboard after successful authentication",
        "Redirection works for both regular login and Internet Identity authentication",
        "Users land on Dashboard Overview page showing their earnings"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Update the login success handler to navigate to '/dashboard' instead of the homepage. Ensure both regular login and Internet Identity authentication flows redirect to the dashboard."
        }
      ]
    },
    {
      "id": "REQ-127",
      "summary": "Create an Earnings Dashboard section displaying four earnings metrics: Today, Weekly, Monthly, and Lifetime Earning",
      "acceptanceCriteria": [
        "Dashboard Overview displays four earnings cards: Today, Weekly, Monthly, Lifetime",
        "Each card shows the earning amount in INR format (₹)",
        "Cards use emerald green accent colors consistent with theme",
        "Layout is responsive across mobile, tablet, and desktop",
        "Earnings cards appear at the top of the Dashboard Overview page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new useGetEarnings hook that fetches earnings data from the backend getEarnings function. The hook should accept a userId parameter and return the four earnings metrics (today, weekly, monthly, lifetime)."
        },
        {
          "path": "frontend/src/pages/user/DashboardOverview.tsx",
          "operation": "modify",
          "description": "Add an Earnings Dashboard section at the top of the page displaying four earnings cards in a responsive grid layout. Use the useGetEarnings hook to fetch data from the backend. Display earnings in INR format (₹) with emerald green accents. Ensure the layout adapts to mobile, tablet, and desktop viewports."
        }
      ]
    },
    {
      "id": "REQ-129",
      "summary": "Add a Withdrawal Request feature to the user dashboard",
      "acceptanceCriteria": [
        "User dashboard includes Withdrawal Request navigation item",
        "Withdrawal request form allows users to submit amount and message",
        "Users can view their previous withdrawal requests with status",
        "Form validation ensures valid amount and message input",
        "Success message displayed after submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/layouts/UserDashboardLayout.tsx",
          "operation": "modify",
          "description": "Add a 'Withdrawal Request' navigation item to the sidebar navigation menu, linking to a new '/withdrawal-requests' route within the user dashboard."
        },
        {
          "path": "frontend/src/pages/user/WithdrawalRequests.tsx",
          "operation": "create",
          "description": "Create a new page component that displays a withdrawal request form (amount and message fields with validation) and a table listing the user's previous withdrawal requests with columns for amount, message, status (pending/approved/rejected), and submission date. Use React Query hooks to fetch and submit data to the backend."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useGetWithdrawalRequests hook that fetches the user's withdrawal requests from the backend getWithdrawalRequests function. Add a useCreateWithdrawalRequest mutation hook for submitting new withdrawal requests."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for '/withdrawal-requests' within the user dashboard section that renders the WithdrawalRequests page component."
        }
      ]
    },
    {
      "id": "REQ-131",
      "summary": "Add a Landing Page Builder/Creator option to the user dashboard",
      "acceptanceCriteria": [
        "User dashboard includes Landing Page Builder navigation item",
        "Landing Page Builder page is accessible to authenticated users",
        "Interface provides tools or options for creating/customizing landing pages",
        "Users can save and preview their created landing pages",
        "Created landing pages are associated with user account"
      ],
      "file_operations": [
        {
          "path": "frontend/src/layouts/UserDashboardLayout.tsx",
          "operation": "modify",
          "description": "Add a 'Landing Page Builder' navigation item to the sidebar navigation menu, linking to a new '/landing-page-builder' route within the user dashboard."
        },
        {
          "path": "frontend/src/pages/user/LandingPageBuilder.tsx",
          "operation": "create",
          "description": "Create a new page component that provides a user-friendly interface for creating and customizing landing pages. Include a form with fields for title, content, and template selection. Display a list of the user's created landing pages with options to edit, delete, and preview. Use React Query hooks to interact with the backend."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetLandingPages, useCreateLandingPage, useUpdateLandingPage, and useDeleteLandingPage hooks for managing landing page data. These hooks should interact with the corresponding backend functions."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for '/landing-page-builder' within the user dashboard section that renders the LandingPageBuilder page component."
        }
      ]
    },
    {
      "id": "REQ-133",
      "summary": "Add an admin Withdrawal Management page to the admin dashboard",
      "acceptanceCriteria": [
        "Admin dashboard includes Withdrawal Management navigation item",
        "Table displays all withdrawal requests with user details",
        "Admins can approve or reject withdrawal requests",
        "Status filter allows viewing by All/Pending/Approved/Rejected",
        "Actions update withdrawal request status in real-time",
        "Success/error messages displayed after status changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/layouts/AdminDashboardLayout.tsx",
          "operation": "modify",
          "description": "Add a 'Withdrawal Management' navigation item to the admin sidebar navigation menu, linking to a new '/admin/withdrawals' route."
        },
        {
          "path": "frontend/src/pages/admin/WithdrawalManagement.tsx",
          "operation": "create",
          "description": "Create a new admin page component that displays all user withdrawal requests in a table with columns: User Name, Amount (₹), Message, Status, Submission Date, and Actions. Implement approve/reject buttons for each request and include a status filter dropdown (All/Pending/Approved/Rejected). Use React Query hooks to fetch and update withdrawal request data."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useGetAllWithdrawalRequests hook that fetches all withdrawal requests from the backend getAllWithdrawalRequests function. Add a useUpdateWithdrawalRequestStatus mutation hook for updating request status."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for '/admin/withdrawals' within the admin dashboard section that renders the WithdrawalManagement page component."
        }
      ]
    }
  ]
}